; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	thermograph1 - mode
	thermograph0 - mode
	infrared2 - mode
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Planet3 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Star19 - direction
	Star20 - direction
	Planet21 - direction
	Planet22 - direction
	Phenomenon23 - direction
	Planet24 - direction
	Phenomenon25 - direction
	Star26 - direction
	Star27 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared2)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet13)
	(supports instrument3 infrared2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph1)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite3)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet15)
	(supports instrument6 infrared2)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 thermograph1)
	(supports instrument7 infrared2)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 infrared2)
	(supports instrument8 thermograph0)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star19)
)
(:goal (and
	(have_image Planet3 thermograph1)
	(have_image Star4 thermograph0)
	(have_image Star5 infrared2)
	(have_image Star6 thermograph1)
	(have_image Phenomenon7 thermograph1)
	(have_image Star8 thermograph1)
	(have_image Star9 thermograph0)
	(have_image Planet11 thermograph0)
	(have_image Planet13 infrared2)
	(have_image Planet14 infrared2)
	(have_image Phenomenon16 thermograph0)
	(have_image Planet17 infrared2)
	(have_image Phenomenon18 infrared2)
	(have_image Star19 thermograph0)
	(have_image Star20 thermograph1)
	(have_image Planet21 infrared2)
	(have_image Planet22 thermograph0)
	(have_image Phenomenon23 infrared2)
	(have_image Planet24 infrared2)
	(have_image Phenomenon25 thermograph0)
	(have_image Star26 infrared2)
))

)

; plan
1. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 0 of 21
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 21
3. (turn_to satellite4 groundstation2 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 groundstation2)
   goals met: 0 of 21
4. (calibrate satellite4 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 0 of 21
5. (turn_to satellite4 phenomenon16 groundstation2)
   deleted: (pointing satellite4 groundstation2)
   added: (pointing satellite4 phenomenon16)
   goals met: 0 of 21
6. (take_image satellite4 phenomenon16 instrument6 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 1 of 21
7. (turn_to satellite4 phenomenon18 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 phenomenon18)
   goals met: 1 of 21
8. (take_image satellite4 phenomenon18 instrument6 infrared2)
   added: (have_image phenomenon18 infrared2)
   goals met: 2 of 21
9. (turn_to satellite4 phenomenon23 phenomenon18)
   deleted: (pointing satellite4 phenomenon18)
   added: (pointing satellite4 phenomenon23)
   goals met: 2 of 21
10. (take_image satellite4 phenomenon23 instrument6 infrared2)
   added: (have_image phenomenon23 infrared2)
   goals met: 3 of 21
11. (turn_to satellite4 phenomenon25 phenomenon23)
   deleted: (pointing satellite4 phenomenon23)
   added: (pointing satellite4 phenomenon25)
   goals met: 3 of 21
12. (take_image satellite4 phenomenon25 instrument6 thermograph0)
   added: (have_image phenomenon25 thermograph0)
   goals met: 4 of 21
13. (turn_to satellite4 planet11 phenomenon25)
   deleted: (pointing satellite4 phenomenon25)
   added: (pointing satellite4 planet11)
   goals met: 4 of 21
14. (take_image satellite4 planet11 instrument6 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 5 of 21
15. (turn_to satellite4 planet13 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet13)
   goals met: 5 of 21
16. (take_image satellite4 planet13 instrument6 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 6 of 21
17. (turn_to satellite4 planet14 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 planet14)
   goals met: 6 of 21
18. (take_image satellite4 planet14 instrument6 infrared2)
   added: (have_image planet14 infrared2)
   goals met: 7 of 21
19. (turn_to satellite4 planet17 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 planet17)
   goals met: 7 of 21
20. (take_image satellite4 planet17 instrument6 infrared2)
   added: (have_image planet17 infrared2)
   goals met: 8 of 21
21. (turn_to satellite4 planet21 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 planet21)
   goals met: 8 of 21
22. (take_image satellite4 planet21 instrument6 infrared2)
   added: (have_image planet21 infrared2)
   goals met: 9 of 21
23. (turn_to satellite4 planet22 planet21)
   deleted: (pointing satellite4 planet21)
   added: (pointing satellite4 planet22)
   goals met: 9 of 21
24. (take_image satellite4 planet22 instrument6 thermograph0)
   added: (have_image planet22 thermograph0)
   goals met: 10 of 21
25. (turn_to satellite4 planet24 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 planet24)
   goals met: 10 of 21
26. (take_image satellite4 planet24 instrument6 infrared2)
   added: (have_image planet24 infrared2)
   goals met: 11 of 21
27. (turn_to satellite4 star19 planet24)
   deleted: (pointing satellite4 planet24)
   added: (pointing satellite4 star19)
   goals met: 11 of 21
28. (take_image satellite4 star19 instrument6 thermograph0)
   added: (have_image star19 thermograph0)
   goals met: 12 of 21
29. (turn_to satellite4 star26 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 star26)
   goals met: 12 of 21
30. (take_image satellite4 star26 instrument6 infrared2)
   added: (have_image star26 infrared2)
   goals met: 13 of 21
31. (turn_to satellite4 star4 star26)
   deleted: (pointing satellite4 star26)
   added: (pointing satellite4 star4)
   goals met: 13 of 21
32. (take_image satellite4 star4 instrument6 thermograph0)
   added: (have_image star4 thermograph0)
   goals met: 14 of 21
33. (turn_to satellite4 star5 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 star5)
   goals met: 14 of 21
34. (take_image satellite4 star5 instrument6 infrared2)
   added: (have_image star5 infrared2)
   goals met: 15 of 21
35. (turn_to satellite4 star9 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 star9)
   goals met: 15 of 21
36. (take_image satellite4 star9 instrument6 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 16 of 21
37. (turn_to satellite0 groundstation1 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation1)
   goals met: 16 of 21
38. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 16 of 21
39. (turn_to satellite0 phenomenon7 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon7)
   goals met: 16 of 21
40. (take_image satellite0 phenomenon7 instrument0 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 17 of 21
41. (turn_to satellite0 planet3 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet3)
   goals met: 17 of 21
42. (take_image satellite0 planet3 instrument0 thermograph1)
   added: (have_image planet3 thermograph1)
   goals met: 18 of 21
43. (turn_to satellite0 star20 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 star20)
   goals met: 18 of 21
44. (take_image satellite0 star20 instrument0 thermograph1)
   added: (have_image star20 thermograph1)
   goals met: 19 of 21
45. (turn_to satellite0 star6 star20)
   deleted: (pointing satellite0 star20)
   added: (pointing satellite0 star6)
   goals met: 19 of 21
46. (take_image satellite0 star6 instrument0 thermograph1)
   added: (have_image star6 thermograph1)
   goals met: 20 of 21
47. (turn_to satellite0 star8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star8)
   goals met: 20 of 21
48. (take_image satellite0 star8 instrument0 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 21 of 21
